// // ссылочное храниение
// arrays
// const arr = [2, 5, 9]
// const secondArr = arr
// secondArr[1] = 10
// console.log(secondArr) // [2, 10, 9]
// console.log(arr) // [2, 10, 9]
// // copy
// // const arr3 = [...arr] // spread operator

// objects
// const obj = {a: 1, b: 2}
// const secondObj = obj
// secondObj.b = 5
// console.log(secondObj) // {a: 1, b: 5}
// console.log(obj) // {a: 1, b: 5}


// Пройдитесь циклом по массиву объектов и найдите общую сумму товаров.

// const products = [
//     {
//         title: "Macbook",
//         price: 4000,
//         type: "Laptop",
//     },
//     {
//         title: "Blander",
//         price: 5056,
//         type: "Kitchen",
//     },
//     {
//         title: "Bacycle",
//         price: 1500,
//         type: "Sport",
//     }
// ]
// let totalPrice = 0
// for(let i = 0; i < products.length; i++) {
//     const {title, price, type} = products[i]
//     console.log(`Title of product: ${products[i].title}`);
//     console.log(`Price of product: ${products[i].price}`);
//     console.log(`Type of product: ${products[i].type}`);
//     console.log(`---`);
//     totalPrice = totalPrice + price
// }
// console.log(`Total Price ${totalPrice}`);

// Вывести названия товаров и цену со скидкой. В процессе решения задачи используйте деструктурирующее присваивание

// const products = [
//     {
//         title: "Macbook",
//         price: 4000,
//         type: "Laptop",
//         discount: 17
//     },
//     {
//         title: "Blander",
//         price: 5056,
//         type: "Kitchen",
//         discount: 8
//     },
//     {
//         title: "Bacycle",
//         price: 1500,
//         type: "Sport",
//         discount: 13
//     }
// ]
// let totalPrice = 0
// for(let i = 0; i < products.length; i++) {
//     const {title, price, type, discount} = products[i]
//     console.log(`Title of product: ${title}`)
//     console.log(`Pric of product: ${price}`)
//     console.log(`Type of product: ${type}`)
//     console.log(`Discount of product: ${discount}`)
//     // const priceWithDiscount = price - price * discount / 100
//     console.log(`Price with discount: ${price - price * discount / 100}`)
//     console.log("==================")
//     totalPrice = totalPrice + price
//     // console.log(`Total price widt discount ${priceWithDiscount}`);
// }
// console.log(`Total Price ${totalPrice}`);



// Создать новый пустой массив. Пройтись циклом по массиву с продуктами и в новый массив добавить те продукты, которые дешевле определенной суммы.(1600)

// const products = [
//     {
//         title: "Macbook",
//         price: 4000,
//         type: "Laptop",
//         discount: 17
//     },
//     {
//         title: "Blander",
//         price: 1000,
//         type: "Kitchen",
//         discount: 8
//     },
//     {
//         title: "Bacycle",
//         price: 1500,
//         type: "Sport",
//         discount: 13
//     }
// ]
// let totalPrice = 0
// const newProducts =  []
// for(let i = 0; i < products.length; i++) {
//     const {title, price, type, discount} = products[i]
//     console.log(`Title of product: ${title}`)
//     console.log(`Pric of product: ${price}`)
//     console.log(`Type of product: ${type}`)
//     console.log(`Discount of product: ${discount}`)
//     // const priceWithDiscount = price - price * discount / 100
//     console.log(`Price with discount: ${price - price * discount / 100}`)
//     console.log("==================")
//     totalPrice = totalPrice + price
//     // console.log(`Total price widt discount ${priceWithDiscount}`);
//     if (price < 1600) {
//     newProducts.push(products[i])
// } 
// }
// console.log(`Total Price ${totalPrice}`);
// console.log(newProducts);


// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

// --------------------       FUNCTIONS        ------------------------------ 

// function greet(name) {
//     // console.log('Hello John!')
//     // console.log('Hello Mary!')
//     // console.log('Hello Jack!')

//         console.log(`Hello ${name}!`)
// }
// greet('John')
// greet('Mary')
// greet('Jack')

// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

// ------------------------    RETURN   --------------------------------------

// function sum(a, b) {
//     const result = a + b
//     // console.log(result)

//     return result
// }
// const sumResult = sum(10, 5)
// console.log(sumResult);

// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

// ------------------------   TASKS     -------------------------------------

// Разобрать простой пример функции, которая считывает значение числа через prompt и выводит квадрат этого числа в консоль. 

// function printPow() {
//     const number = +prompt('Введите число')
//     console.log(number ** 2)
// }
// printPow()

// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

// ------------------------    POWER   --------------------------------------

// Рассмотреть пример функции power, которая получает два аргумента (первый это основание степени, а второй сама степень) и выводит в консоль результат вычислений. 

// function power(a, b) {
//     console.log(a ** b);
// }
// power(5)
// power(10)
// power (3, 3)

// Создать функцию, которая в качестве аргументов получает два числа и выводит в консоль наибольшее.

// function power(a, b) {
//     if (a < b) {
//         console.log(b)
//     } else if (a > b) {
//     console.log(a);
//     } else {
//         console.log('equal');
//     }
// }
// power(4, 9)
// power(45, 653)

// Переписать функцию power таким образом, чтобы она возвращала результат вычислений
// function power(a, b = 2) {
//     // console.log(a ** b)
//     return a ** b // return a ** 2 // return 81
// }
// const result = power(9) // const result = 81
// console.log(result) // 81

// Описать процесс, используя функцию power, который находит гипотенузу по длине двух катетов (теорема Пифагора).

// Описать процесс, используя функцию power, который находит гипотенузу по длине двух катетов c размерами 3 и 4 (теорема Пифагора).
// c**2 = a**2 + b**2
// const a = 3
// const b = 4
// const sum = power(a) + power(b) // 3**2 + 4**2 = 25
// const c = power(sum, 0.5) // 25**1/2 = 5
// console.log(c)
// console.log(power(power(a) + power(b), 0.5))


// Описать функцию, которая получает число и возвращает true, если число четное и false в ином случае. isEven
// function isEven(a) {
//     // if(a % 2 === 0) {
//     //     return true
//     // } else {
//     //     return false
//     // }

//     // if(a % 2 === 0) {
//     //     return true
//     // }
//     // return false

//     return a % 2 === 0
// }

// console.log(isEven(8));
// console.log(isEven(11));


// // function declaration
// // function greet(name) {
// //     console.log(`Hello ${name}!`)
// // }
// // function expression
// const greet = function(name) {
//     console.log(`Hello ${name}!`)
// }
// greet("John")

// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

//  ----------------------   METHODS   ------------------------------

// const user = {
//     name: "John",
//     greeting: function(name) {
//         console.log(`Hello ${name}!`)
//     }
// }
// user.greeting("Mary")
// user.greeting("Jack")

// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

// ----------------------   VAR   --------------------------------------------

// if (1 === 1) {
//     var text = "Hello"
//     console.log(text)
// }
// console.log(text) // "Hello"

// console.log(hello) // undefined (not error)
// var hello = "Hello"

// var name = "John"
// var name = "Mary"

// ---------------------------------------------------------------------------
// --------------------- ------- ------- ------- -----------------------------
// -------------------- - ----- - ----- - ----- - ----------------------------
// ------------------- --- --- --- --- --- --- --- ---------------------------
// ------------------ ------ ------- ------- ---- ----------------------------
// ------------------- --------- ------- ------- -----------------------------
// -------------------- -------- ------- ------ ------------------------------

