// 1

// для того чтобы отрисовать элементы надо выбрать элементы в котром будем отрисовават
// для того чтобы взяли элемент с классом "numbers" используем метод DOM - querySelector
// const numbersBox = document.querySelector(".numbers");

// // делаем цикл от 100 то 50(включительно)
// for (let i = 100; i >= 50; i--) {
//   // делаю проверку если число делится на 10 то пусть заработает тело условия
//   if (i % 10 === 0) {
//     // во время каждой итерации создаем параграф
//     const p = document.createElement("p");
//     // параграфу присваеваем то значение которое итерируется и соотверстувет условию
//     p.textContent = i;
//     // после того как мы созадли параграф и дали ему значение то добавляем данный параграф
//     // в элемент с классом "numbers"
//     numbersBox.append(p);
//   }
// }


// ------------------------------------    Oleksandr Karadiaur    ----------------------------------


// for (let i = 100; i >= 50; i -= 10) {
//   // делаю проверку если число делится на 10 то пусть заработает тело условия
//   // во время каждой итерации создаем параграф
//   const p = document.createElement("p");
//   // параграфу присваеваем то значение которое итерируется и соотверстувет условию
//   p.textContent = i;
//   // после того как мы созадли параграф и дали ему значение то добавляем данный параграф
//   // в элемент с классом "numbers"
//   numbersBox.append(p);
// }

// ---------------------------------------------------------------------------------------------------------
 


